'''
파일명: Ex23-1-BubbleSort.py

1. 버블 정렬(Bubble Sort)
    인접한 두 원소를 비교하여 정렬하는 알고리즘 중 하나로,
    가장 간단한 정렬 알고리즘 중 하나이다.

    시간복잡도 : O(n^2)
'''

def bubble_sort(arr):

    '''
    arr = [5, 6, 3, 1, 8, 7, 2, 4]

    n = 8
    i = 0
        j =  0, arr[0] > arr[1] -> 6 > 5 ->  [5, 6, 3, 1, 8, 7, 2, 4]
            1, -> 6 > 3 -> [5, 3, 6, 1, 8, 7, 2, 4]
            2, -> 6 > 1 -> [5, 3, 1, 6, 8, 7, 2, 4]
            3, -> 6 > 8 -> [5, 3, 1, 6, 8, 7, 2, 4]
            4, -> 8 > 7 -> [5, 3, 1, 6, 7, 8, 2, 4]
            5, -> 8 > 2 -> [5, 3, 1, 6, 7, 2, 8, 4]
            6  -> 8 > 4 -> [5, 3, 1, 6, 7, 2, 4, 8]


    '''

    n = len(arr)

    for i in range(n):
        for j in range(n - i - 1):
            if arr[j] > arr[j + 1]:
                arr[j], arr[j + 1] = arr[j + 1], arr[j]

    return arr

# 실행코드
arr = [6, 5, 3, 1, 8, 7, 2, 4]
print(bubble_sort(arr))














